clojure-packaging.org
#+TITLE: Clojure: Packaging
#+DESCRIPTION: Notes from studying Clojure

#+INCLUDE: "../web/config.org"

* Intro
This is a how-to and my personal notes on how to package a Clojure project to minimize the size. The following steps are semi-independent of each other

* Building an Uberjar
For this you need to get a =deps.edn= extension and plug it into your project. There are multiple options that all seem to do something similar. For some of the coming steps it's best to get AOT compilation working - but it's not strictly necessary.

** Depstar (BROKEN)
This project is currently maintained (as of 2020)

You add the following alias at the end of your =deps.edn= file
#+BEGIN_SRC clojure
  :aliases {:depstar {:extra-deps
		      {seancorfield/depstar {:mvn/version "0.5.2"}}
		      :main-opts ["-m" "hf.depstar.uberjar"
				  "sausage.jar" "--compile"
				  "-m" "sausage.core"]}}
#+END_SRC
And then call it from the command line
#+BEGIN_SRC shell
clj -A:depstar
#+END_SRC

If you have issues with AOT compilation, you can also build a JIT version by removing ~"--compile"~ from the alias above.

BROKEN: As of right now the AOT compilation doesn't work with =cljfx=.

SEE: https://github.com/cljfx/cljfx/issues/63

UPDATE: workaround -> https://github.com/cljfx/cljfx/issues/63#issuecomment-611971477

However if you're not using =cljfx= then this library is a good options!

** Cambada

Since Depstar doesn't work right off the bat I switched to Cambada - which also supposidly supports GraalVM output. The only issue is that it's seemingly no longer maintained. Issues go unanswered and there are no updates. That said, it seems to work great

#+BEGIN_SRC clojure
 :aliases {;; call 'clj -A:uberjar' to run
           :uberjar {:extra-deps {luchiniatwork/cambada {:mvn/version "1.0.2"}}
                     :main-opts ["-m" "cambada.uberjar"
                                 "--aot" "all"
                                 "-m" "sausage.core"]}
           :native-image {:extra-deps
                          {luchiniatwork/cambada {:mvn/version "1.0.0"}}
                          :main-opts ["-m" "cambada.native-image"
                                      "-m" "sausage.core"]}
#+END_SRC
Just run
#+BEGIN_SRC shell
clj -A:uberjar
#+END_SRC

And the uberjar gets assembled in a =target/= folder

At this point you will likely find the resutling JAR is huge. I was a ~200MB monster for me

* Minimizing binaries/dependencies
A moderately size project will start to drag in huge amounts of libraries through its dependencies. To minimize dependencies and included binaries you need to first check your dependency tree
#+BEGIN_SRC shell
$ clj -Stree
# huge indented tree
# ...
# ...
#+END_SRC
Through this you should generally be able to visually identify whole subtrees that will clearly never being used by your program. You then need to modify your =deps.edn= file to explicitely exclude these from the dependency tree using the ~:exclusions~ keyword. Ex:
#+BEGIN_SRC clojure
{:deps
 {org.clojure/clojure {:mvn/version "1.10.0"}
  org.boofcv/boofcv-core {:mvn/version "0.35"
                          :exclusions [org.boofcv/boofcv-recognition]}
  cljfx {:mvn/version "1.6.7"
         :exclusions [org.openjfx/javafx-web
                      org.openjfx/javafx-media]}
;; ... etc.
#+END_SRC
Be conservative and only remove parts that you will definitely not touch. The goal here is /not/ to be exhaustive b/c this will be an added maintenance burden. If you later start to use new sections of an included libraries, you don't want to get confusing errors and then have to go back to your =deps.edn= file to hunt for what exclusions neeeds to be removed.

Note that we later will use Proguard to remove unused JVM code more aggressively. So focus on nuking native binaries and things like CLJS/Javascript/HTML. These, non JVM piece will not be removed with Proguard, so you need to do this manually.

In my case I needed to remove some large webview/media binaries that I will not be using with =javafx=, a complex CV section of =boofcv= and a clojurescript tie-in for =thi.ng/geom=

Source: https://clojure.org/reference/deps_and_cli#_dependencies

