clojure-packaging.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Clojure: Packaging</title>
<meta name="generator" content="Org mode">
<meta name="author" content="George Kontsevich">
<meta name="description" content="Notes from studying Clojure"
>
<link rel="stylesheet" type="text/css" href="../web/worg.css" />
<link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
</head>
<body>
<div id="content">
<h1 class="title">Clojure: Packaging</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org838ba57">Intro</a></li>
<li><a href="#org15f2b2b">Building an Uberjar</a>
<ul>
<li><a href="#org2f0cd15">Depstar (BROKEN)</a></li>
<li><a href="#orge58b86d">Cambada</a></li>
</ul>
</li>
<li><a href="#orgcd2132e">Minimizing binaries/dependencies</a></li>
<li><a href="#org9aefd6e">Making sure you get crossplatform binaries</a></li>
<li><a href="#org56d4be1">Proguard (WIP)</a></li>
<li><a href="#orga55d12e">JPackage</a></li>
<li><a href="#org068e53c">JLink</a></li>
<li><a href="#org3ccd978">GraalVM</a></li>
</ul>
</div>
</div>

<div id="outline-container-org838ba57" class="outline-2">
<h2 id="org838ba57">Intro</h2>
<div class="outline-text-2" id="text-org838ba57">
<p>
This is a how-to and my personal notes on how to package a Clojure project to minimize the size. The following steps are semi-independent of each other
</p>
</div>
</div>

<div id="outline-container-org15f2b2b" class="outline-2">
<h2 id="org15f2b2b">Building an Uberjar</h2>
<div class="outline-text-2" id="text-org15f2b2b">
<p>
For this you need to get a <code>deps.edn</code> extension and plug it into your project. There are multiple options that all seem to do something similar. For some of the coming steps it's best to get AOT compilation working - but it's not strictly necessary.
</p>
</div>

<div id="outline-container-org2f0cd15" class="outline-3">
<h3 id="org2f0cd15">Depstar (BROKEN)</h3>
<div class="outline-text-3" id="text-org2f0cd15">
<p>
This project is currently maintained (as of 2020)
</p>

<p>
You add the following alias at the end of your <code>deps.edn</code> file
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #008b8b;">:aliases</span> {<span style="color: #008b8b;">:depstar</span> {<span style="color: #008b8b;">:extra-deps</span>
                    {<span style="color: #228b22;">seancorfield</span>/depstar {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"0.5.2"</span>}}
                    <span style="color: #008b8b;">:main-opts</span> [<span style="color: #8b2252;">"-m"</span> <span style="color: #8b2252;">"hf.depstar.uberjar"</span>
                                <span style="color: #8b2252;">"sausage.jar"</span> <span style="color: #8b2252;">"--compile"</span>
                                <span style="color: #8b2252;">"-m"</span> <span style="color: #8b2252;">"sausage.core"</span>]}}
</pre>
</div>
<p>
And then call it from the command line
</p>
<div class="org-src-container">
<pre class="src src-shell">clj -A:depstar
</pre>
</div>

<p>
If you have issues with AOT compilation, you can also build a JIT version by removing <code>"--compile"</code> from the alias above.
</p>

<p>
BROKEN: As of right now the AOT compilation doesn't work with <code>cljfx</code>.
</p>

<p>
SEE: <a href="https://github.com/cljfx/cljfx/issues/63">https://github.com/cljfx/cljfx/issues/63</a>
</p>

<p>
UPDATE: workaround -&gt; <a href="https://github.com/cljfx/cljfx/issues/63#issuecomment-611971477">https://github.com/cljfx/cljfx/issues/63#issuecomment-611971477</a>
</p>

<p>
However if you're not using <code>cljfx</code> then this library is a good options!
</p>
</div>
</div>

<div id="outline-container-orge58b86d" class="outline-3">
<h3 id="orge58b86d">Cambada</h3>
<div class="outline-text-3" id="text-orge58b86d">
<p>
Since Depstar doesn't work right off the bat I switched to Cambada - which also supposidly supports GraalVM output. The only issue is that it's seemingly no longer maintained. Issues go unanswered and there are no updates. That said, it seems to work great
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #008b8b;">:aliases</span> {<span style="color: #b22222;">;; </span><span style="color: #b22222;">call 'clj -A:uberjar' to run</span>
          <span style="color: #008b8b;">:uberjar</span> {<span style="color: #008b8b;">:extra-deps</span> {<span style="color: #228b22;">luchiniatwork</span>/cambada {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.0.2"</span>}}
                    <span style="color: #008b8b;">:main-opts</span> [<span style="color: #8b2252;">"-m"</span> <span style="color: #8b2252;">"cambada.uberjar"</span>
                                <span style="color: #8b2252;">"--aot"</span> <span style="color: #8b2252;">"all"</span>
                                <span style="color: #8b2252;">"-m"</span> <span style="color: #8b2252;">"sausage.core"</span>]}
          <span style="color: #008b8b;">:native-image</span> {<span style="color: #008b8b;">:extra-deps</span>
                         {<span style="color: #228b22;">luchiniatwork</span>/cambada {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.0.0"</span>}}
                         <span style="color: #008b8b;">:main-opts</span> [<span style="color: #8b2252;">"-m"</span> <span style="color: #8b2252;">"cambada.native-image"</span>
                                     <span style="color: #8b2252;">"-m"</span> <span style="color: #8b2252;">"sausage.core"</span>]}
</pre>
</div>
<p>
Just run
</p>
<div class="org-src-container">
<pre class="src src-shell">clj -A:uberjar
</pre>
</div>

<p>
And the uberjar gets assembled in a <code>target/</code> folder
</p>

<p>
At this point you will likely find the resutling JAR is huge. I was a ~200MB monster for me
</p>
</div>
</div>
</div>

<div id="outline-container-orgcd2132e" class="outline-2">
<h2 id="orgcd2132e">Minimizing binaries/dependencies</h2>
<div class="outline-text-2" id="text-orgcd2132e">
<p>
A moderately size project will start to drag in huge amounts of libraries through its dependencies. To minimize dependencies and included binaries you need to first check your dependency tree
</p>
<div class="org-src-container">
<pre class="src src-shell">$ clj -Stree
<span style="color: #b22222;"># </span><span style="color: #b22222;">huge indented tree</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">...</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">...</span>
</pre>
</div>
<p>
Through this you should generally be able to visually identify whole subtrees that will clearly never being used by your program. You then need to modify your <code>deps.edn</code> file to explicitely exclude these from the dependency tree using the <code>:exclusions</code> keyword. Ex:
</p>
<div class="org-src-container">
<pre class="src src-clojure">{<span style="color: #008b8b;">:deps</span>
 {<span style="color: #228b22;">org.clojure</span>/clojure {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.10.0"</span>}
  <span style="color: #228b22;">org.boofcv</span>/boofcv-core {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"0.35"</span>
                          <span style="color: #008b8b;">:exclusions</span> [<span style="color: #228b22;">org.boofcv</span>/boofcv-recognition]}
  cljfx {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.6.7"</span>
         <span style="color: #008b8b;">:exclusions</span> [<span style="color: #228b22;">org.openjfx</span>/javafx-web
                      <span style="color: #228b22;">org.openjfx</span>/javafx-media]}
<span style="color: #b22222;">;; </span><span style="color: #b22222;">... etc.</span>
</pre>
</div>
<p>
Be conservative and only remove parts that you will definitely not touch. The goal here is <i>not</i> to be exhaustive b/c this will be an added maintenance burden. If you later start to use new sections of an included libraries, you don't want to get confusing errors and then have to go back to your <code>deps.edn</code> file to hunt for what exclusions neeeds to be removed.
</p>

<p>
Note that we later will use Proguard to remove unused JVM code more aggressively. So focus on nuking native binaries and things like CLJS/Javascript/HTML. These, non JVM piece will not be removed with Proguard, so you need to do this manually.
</p>

<p>
In my case I needed to remove some large webview/media binaries that I will not be using with <code>javafx</code>, a complex CV section of <code>boofcv</code> and a clojurescript tie-in for <code>thi.ng/geom</code>
</p>

<p>
Source: <a href="https://clojure.org/reference/deps_and_cli#_dependencies">https://clojure.org/reference/deps_and_cli#_dependencies</a>
</p>
</div>
</div>
