clojure-packaging.org
* Making sure you get crossplatform binaries
Some libraries reply on native binaries that you simply unavoidably will need. These binaries will get bundled with your code in the =.jar=. 

The issue is that dependencies will sometimes decide on what binaries you get based on the system you're building on. For instance if you build on Linux, the Windows/MacOS binaries are missing and the =.jar= won't run when you drag it over to a different machine. So you will need to explicitely add the crossplatform dependencies using a =deps.end= [[https://clojure.org/reference/deps_and_cli#_dependencies][classifier]]. This is an extra param of the form ~$blahblah~ that comes after your dependency name. In my project I include the library =cljfx= which then included =javafx= and its associated binaries. When I build on my Ubuntu machine the Windows/MacOS binaries were left out so I need to explicitely add them back in
#+BEGIN_SRC clojure
{:deps
 {org.clojure/clojure {:mvn/version "1.10.0"}
  org.boofcv/boofcv-core {:mvn/version "0.35"
                          :exclusions [org.boofcv/boofcv-recognition]}
  cljfx {:mvn/version "1.6.7"
         :exclusions [org.openjfx/javafx-web
                      org.openjfx/javafx-media]}
  org.openjfx/javafx-base {:mvn/version "14"}
  org.openjfx/javafx-base$linux {:mvn/version "14"}
  org.openjfx/javafx-base$mac {:mvn/version "14"}
  org.openjfx/javafx-base$win {:mvn/version "14"}
  org.openjfx/javafx-controls {:mvn/version "14"}
  org.openjfx/javafx-controls$linux {:mvn/version "14"}
  org.openjfx/javafx-controls$mac {:mvn/version "14"}
  org.openjfx/javafx-controls$win {:mvn/version "14"}
  org.openjfx/javafx-graphics {:mvn/version "14"}
  org.openjfx/javafx-graphics$linux {:mvn/version "14"}
  org.openjfx/javafx-graphics$mac {:mvn/version "14"}
  org.openjfx/javafx-graphics$win {:mvn/version "14"}
  org.openjfx/javafx-swing {:mvn/version "14"}
  org.openjfx/javafx-swing$linux {:mvn/version "14"}
  org.openjfx/javafx-swing$mac {:mvn/version "14"}
  org.openjfx/javafx-swing$win {:mvn/version "14"}
#+END_SRC

Credit: *vlaaad* https://old.reddit.com/r/Clojure/comments/fw93gc/new_clojurians_ask_anything/fmspx8m/

