clojure-packaging.html

<div id="outline-container-org9aefd6e" class="outline-2">
<h2 id="org9aefd6e">Making sure you get crossplatform binaries</h2>
<div class="outline-text-2" id="text-org9aefd6e">
<p>
Some libraries reply on native binaries that you simply unavoidably will need. These binaries will get bundled with your code in the <code>.jar</code>. 
</p>

<p>
The issue is that dependencies will sometimes decide on what binaries you get based on the system you're building on. For instance if you build on Linux, the Windows/MacOS binaries are missing and the <code>.jar</code> won't run when you drag it over to a different machine. So you will need to explicitely add the crossplatform dependencies using a <code>deps.end</code> <a href="https://clojure.org/reference/deps_and_cli#_dependencies">classifier</a>. This is an extra param of the form <code>$blahblah</code> that comes after your dependency name. In my project I include the library <code>cljfx</code> which then included <code>javafx</code> and its associated binaries. When I build on my Ubuntu machine the Windows/MacOS binaries were left out so I need to explicitely add them back in
</p>
<div class="org-src-container">
<pre class="src src-clojure">{<span style="color: #008b8b;">:deps</span>
 {<span style="color: #228b22;">org.clojure</span>/clojure {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.10.0"</span>}
  <span style="color: #228b22;">org.boofcv</span>/boofcv-core {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"0.35"</span>
                          <span style="color: #008b8b;">:exclusions</span> [<span style="color: #228b22;">org.boofcv</span>/boofcv-recognition]}
  cljfx {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.6.7"</span>
         <span style="color: #008b8b;">:exclusions</span> [<span style="color: #228b22;">org.openjfx</span>/javafx-web
                      <span style="color: #228b22;">org.openjfx</span>/javafx-media]}
  <span style="color: #228b22;">org.openjfx</span>/javafx-base {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-base$linux {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-base$mac {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-base$win {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-controls {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-controls$linux {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-controls$mac {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-controls$win {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-graphics {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-graphics$linux {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-graphics$mac {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-graphics$win {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-swing {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-swing$linux {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-swing$mac {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
  <span style="color: #228b22;">org.openjfx</span>/javafx-swing$win {<span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #181612; background-color: #fcfcfc;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"14"</span>}
</pre>
</div>

<p>
Credit: <b>vlaaad</b> <a href="https://old.reddit.com/r/Clojure/comments/fw93gc/new_clojurians_ask_anything/fmspx8m/">https://old.reddit.com/r/Clojure/comments/fw93gc/new_clojurians_ask_anything/fmspx8m/</a>
</p>
</div>
</div>
