clojure-packaging.html

<div id="outline-container-org56d4be1" class="outline-2">
<h2 id="org56d4be1">Proguard (WIP)</h2>
<div class="outline-text-2" id="text-org56d4be1">
<p>
The next step is using the automated tool Proguard to minimize the JAR further. This tool is supposed to traverse the your application and explore all possible execution paths to identify dead code, and untouched dependencies. This isn't looking at calls out to native libraries and such - so this is confined purely to the JVM code. Proguard is driven by a config file typically called <code>proguard.pro</code> which can very complicated and confusing.
</p>

<p>
We start off by telling proguard the input <code>.jar</code> file name and then output minimized <code>.jar</code> name
</p>
<div class="org-src-container">
<pre class="src src-shell">-injars  sausage.jar
-outjars small-sausage.jar
</pre>
</div>

<p>
We also want to disable features of Proguard we don't care about - particularly optimization and obfuscation
</p>

<div class="org-src-container">
<pre class="src src-shell">-dontoptimize
-dontobfuscate
</pre>
</div>

<p>
We also want to tell it to save all clojure classes - just wholesale
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">Tell proguard to leave the clojure runtime alone</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">You would need to add any other classes that you wish to preserve here.</span>
-keep class clojure.** { *; }
-keep class java.** { *; }
-keep class javax.** { *; }
</pre>
</div>

<p>
Next we tell Proguard where our JVM classes are. First I tried:
</p>
<div class="org-src-container">
<pre class="src src-shell">-libraryjars /usr/lib/jvm/java-11-openjdk-amd64/lib/
</pre>
</div>
<p>
When I ran things I got a crash:
</p>
<div class="org-src-container">
<pre class="src src-shell">ProGuard, version 6.2.2
Reading input...
Reading program jar [/home/geokon/Junk/proguardtest/sausage.jar] (filtered)
Reading library directory [/usr/lib/jvm/java-11-openjdk-amd64/lib] (filtered)
java.io.IOException: Can<span style="color: #8b2252;">'t read [/usr/lib/jvm/java-11-openjdk-amd64/lib] (Can'</span>t read [src.zip] (/usr/lib/jvm/java-11-openjdk-amd64/lib/src.zip (No such file or directory)))
</pre>
</div>

<p>
Since I'm running with OpenJDK 11 it turns out I need to update things to use <code>jmodules</code> (these "modules" are a newer Java feature)
</p>
<div class="org-src-container">
<pre class="src src-shell">-libraryjars &lt;java.home&gt;/jmods/java.base.jmod(!**.jar;!module-info.class)
</pre>
</div>
<p>
This snippet is straight from the Proguard example.The example even says
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">As of Java 9, the runtime classes are packaged in modular jmod files.</span>
</pre>
</div>
<p>
However if I go into <code>/usr/lib/jvm/java-11-openjdk-amd64</code> there was no <code>jmods</code> folder there. While I've been doing everything so far just using the Java runtime (from Ubuntu package <code>openjdk-11-jre</code>), it turns out this <code>jmods</code> folder comes with the JDK and I neeed to additionally install <code>openjdk-11-jdk</code>. Then the folder appears finally.
</p>

<p>
Rerunning things again the output now gives thousands of lines of garbage that look like this
</p>
<div class="org-src-container">
<pre class="src src-shell">Warning: org.apache.batik.gvt.event.AWTEventDispatcher: can<span style="color: #8b2252;">'t find superclass or interface java.awt.event.MouseListener</span>
<span style="color: #8b2252;">Warning: org.yaml.snakeyaml.introspector.PropertySubstitute: can'</span>t find referenced class java.util.logging.Level
Warning: org.yaml.snakeyaml.introspector.PropertySubstitute: can<span style="color: #8b2252;">'t find referenced class java.util.logging.Logger</span>
<span style="color: #8b2252;">Warning: org.mozilla.javascript.tools.shell.JSConsole: can'</span>t find referenced class javax.swing.SwingUtilities
Warning: org.mozilla.javascript.tools.shell.JSConsole: can<span style="color: #8b2252;">'t find referenced class javax.swing.JOptionPane</span>
<span style="color: #8b2252;">Warning: org.mozilla.javascript.tools.shell.JSConsole: can'</span>t find referenced class javax.swing.JFileChooser
Warning: org.apache.xmlgraphics.java2d.GraphicContext: can<span style="color: #8b2252;">'t find referenced class java.awt.Font</span>
<span style="color: #8b2252;">Warning: org.apache.xmlgraphics.java2d.GraphicContext: can'</span>t find referenced class java.awt.Font
Warning: org.apache.logging.log4j.core.jackson.ListOfMapEntrySerializer: can<span style="color: #8b2252;">'t find referenced class com.fasterxml.jackson.databind.SerializerProvider</span>
<span style="color: #8b2252;">Warning: org.apache.logging.log4j.core.jackson.ListOfMapEntrySerializer: can'</span>t find referenced class com.fasterxml.jackson.databind.SerializerProvider
Warning: org.apache.logging.log4j.core.jackson.ListOfMapEntrySerializer: can<span style="color: #8b2252;">'t find referenced class com.fasterxml.jackson.databind.SerializerProvider</span>
</pre>
</div>

<p>
It turns out that the default it just loading the "core" Java libraries. A whole bunch of these libraries are in other modules. You go look up the <b>Java 11</b> javadoc for something like <a href="https://docs.oracle.com/en/java/javase/11/docs/api/java.logging/java/util/logging/Level.html">for instance <code>java.util.logging.Level</code></a>  
</p>

<p>
At the top it says <code>Module java.logging</code>. You go through all the missing classes and repeat this. There are a few quirks.. And some thing you will simply not find in Java 11 (because it's been removed). 
</p>

<div class="org-src-container">
<pre class="src src-shell">-libraryjars &lt;java.home&gt;/jmods/java.base.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.desktop.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.logging.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.xml.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.datatransfer.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.sql.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.compiler.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.management.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.naming.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.scripting.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/java.net.http.jmod(!**.jar;!module-info.class)
</pre>
</div>

<p>
A few links were expecting the JDK - this is probably erronious, but can be added
</p>

<div class="org-src-container">
<pre class="src src-shell">-libraryjars &lt;java.home&gt;/jmods/jdk.jdi.jmod(!**.jar;!module-info.class)
-libraryjars &lt;java.home&gt;/jmods/jdk.jfr.jmod(!**.jar;!module-info.class)
</pre>
</div>

<p>
At this point you will probably still have thousands of warnings. Things linking to old runtimes, things linking to libraries you've never used.. etc.
</p>

<p>
Getting all these to dissappear seems to be impossible. To force proguard to still give you a minimized JAR you need to then tell it to ignore the warning and keep going
</p>

<div class="org-src-container">
<pre class="src src-shell">-ignorewarnings
</pre>
</div>

<p>
However at this point you try to run the executable and most likely it'll crash b/c some class was erased even though it shouldn't have been. It's unclear what evil forces are at hand here and why some stuff is removed while others are not. But at this point you need to go into the config and add <code>-keep</code> rules to make sure ciritcal classes don't get removed
</p>

<p>
Here the configuration gets torturous. You run proguard, run the minimized JAR, it crashed due to a missing class, you add a <code>-keep</code> rule. Rinse and repeat over and over. You can use wildcards to at least save whole name spaces and save your sanity
</p>

<p>
My final file looked something like this:
</p>
<div class="org-src-container">
<pre class="src src-shell">-keep class clojure.** { *; }
-keep class java.** { *; }
-keep class javax.** { *; }
-keep class cljfx.** { *; }
-keep class sausage.** { *; }
-keep class afester.** { *; }
-keep class javafx.** { *; }
-keep class com.sun.** { *; }
-keep class jogamp.** { *; }
-keep class com.jogamp.** { *; }
-keep class java.awt.** { *; }
-keep class module-info

-keep class org.apache.logging.log4j.** { *; }
-keep class boofcv.io.image.UtilImageIO{ *; }
-keep class boofcv.core.image.ConvertImage{ *; }
-keep class boofcv.io.image.ConvertBufferedImage { *; }
-keep class boofcv.alg.misc.ImageMiscOps{ *; }
-keep class javafx.embed.swing.SwingFXUtils{ *; }
-keep class boofcv.io.image.UtilImageIO{ *; }
-keep class javafx.embed.swing.SwingFXUtils{ *; }
-keep class boofcv.alg.misc.ImageMiscOps { *; }
</pre>
</div>

<p>
This is by no means minimized. My JAR went from 37MB to 23MB. With enough monkeys hitting the keyboard you could probably get this under 20MB. The issue is ofcourse that this is a whole headache to manage in parallel to your code. So as your codebase evolves and you start to touch new pieces of your dependencies, this file will need to be updated as well. But because there is no rhyme of reason to why classes get removed - the process ends up rather haphazard and you can never be quite sure if the finaly JAR is working unless you have very exhaustive tests
</p>

<p>
Done with the help of <b>goldenfolding</b>: <a href="https://old.reddit.com/r/Clojure/comments/fw93gc/new_clojurians_ask_anything/fmvnq4q/">https://old.reddit.com/r/Clojure/comments/fw93gc/new_clojurians_ask_anything/fmvnq4q/</a>
</p>
</div>
</div>

<div id="outline-container-orga55d12e" class="outline-2">
<h2 id="orga55d12e">JPackage</h2>
</div>
<div id="outline-container-org068e53c" class="outline-2">
<h2 id="org068e53c">JLink</h2>
</div>
<div id="outline-container-org3ccd978" class="outline-2">
<h2 id="org3ccd978">GraalVM</h2>
</div>
</div>
</body>
</html>
